cmsis-svd/cmsis-svd/data/Spansion/MB9BF31xT_svd.xml
        <!-- REGISTER "PFRF" -->
        <register>
          <name>PFRF</name>
          <description>Port function setting register F</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF6" -->
            <field>
              <name>PF6</name>
              <description>Bit6 of PFRF</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF5" -->
            <field>
              <name>PF5</name>
              <description>Bit5 of PFRF</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF4" -->
            <field>
              <name>PF4</name>
              <description>Bit4 of PFRF</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF3" -->
            <field>
              <name>PF3</name>
              <description>Bit3 of PFRF</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF2" -->
            <field>
              <name>PF2</name>
              <description>Bit2 of PFRF</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF1" -->
            <field>
              <name>PF1</name>
              <description>Bit1 of PFRF</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF0" -->
            <field>
              <name>PF0</name>
              <description>Bit0 of PFRF</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description>Pull-up Setting Register 5</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description>Pull-up Setting Register 6</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description>Pull-up Setting Register 7</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description>Pull-up Setting Register 8</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCR9" -->
        <register derivedFrom="PFR9">
          <name>PCR9</name>
          <description>Pull-up Setting Register 9</description>
          <addressOffset>0x124</addressOffset>
        </register>
        <!-- REGISTER "PCRA" -->
        <register derivedFrom="PFRA">
          <name>PCRA</name>
          <description>Pull-up Setting Register A</description>
          <addressOffset>0x128</addressOffset>
        </register>
        <!-- REGISTER "PCRB" -->
        <register derivedFrom="PFRB">
          <name>PCRB</name>
          <description>Pull-up Setting Register B</description>
          <addressOffset>0x12C</addressOffset>
        </register>
        <!-- REGISTER "PCRC" -->
        <register derivedFrom="PFRC">
          <name>PCRC</name>
          <description>Pull-up Setting Register C</description>
          <addressOffset>0x130</addressOffset>
        </register>
        <!-- REGISTER "PCRD" -->
        <register derivedFrom="PFRD">
          <name>PCRD</name>
          <description>Pull-up Setting Register D</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "PCRF" -->
        <register derivedFrom="PFRF">
          <name>PCRF</name>
          <description>Pull-up Setting Register F</description>
          <addressOffset>0x13C</addressOffset>
        </register>
