cmsis-svd/cmsis-svd/data/Spansion/MB9BF31xT_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USBETHERCLK" -->
    <peripheral>
      <name>USBETHERCLK</name>
      <description>USB/Ethernet Clock</description>
      <groupName>USBETHERCLK</groupName>
      <baseAddress>0x40036000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UCCR" -->
        <register>
          <name>UCCR</name>
          <description>USB/Ethernet-PLL Clock Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UCEN1" -->
            <field>
              <name>UCEN1</name>
              <description>USB1 clock output enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCSEL1" -->
            <field>
              <name>UCSEL1</name>
              <description>USB1 clock selection bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCSEL0" -->
            <field>
              <name>UCSEL0</name>
              <description>USB0 clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN0" -->
            <field>
              <name>UCEN0</name>
              <description>USB0 clock output enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR1" -->
        <register>
          <name>UPCR1</name>
          <description>USB/Ethernet-PLL Control Register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPINC" -->
            <field>
              <name>UPINC</name>
              <description>USB/Ethernet-PLL input clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPLLEN" -->
            <field>
              <name>UPLLEN</name>
              <description>USB/Ethernet-PLL oscillation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR2" -->
        <register>
          <name>UPCR2</name>
          <description>USB/Ethernet-PLL Control Register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPOWT" -->
            <field>
              <name>UPOWT</name>
              <description>USB/Ethernet-PLL oscillation stabilization wait time setting bit</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR3" -->
        <register>
          <name>UPCR3</name>
          <description>USB/Ethernet-PLL Control Register 3</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLK" -->
            <field>
              <name>UPLLK</name>
              <description>Frequency division ratio (K) setting bit of the USB/Ethernet-PLL clock </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR4" -->
        <register>
          <name>UPCR4</name>
          <description>USB/Ethernet-PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3B</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLN" -->
            <field>
              <name>UPLLN</name>
              <description>Frequency division ratio (N) setting bit of the USB/Ethernet-PLL clock </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
